In [1]:
import numpy as np
import pandas as pd
import ast
import os
os.chdir('E:/Test')

In [6]:
df = pd.read_excel('SplitDictDFColumns.xlsx')
df.head()

   Data_Id                                          Employees
0     1210  {'Id': 121, 'Name': 'Sangita Shah', 'Salary': ...
1     1211  {'Id': 122, 'Name': 'Suraj Kale', 'Salary': 25...
2     1212  {'Id': 123, 'Name': 'Ranjan Suri', 'Salary': 1...
3     1213  {'Id': 124, 'Name': 'Manju Shakya', 'Salary': ...

In [7]:
df_emp = pd.DataFrame([ast.literal_eval(i) for i in df.Employees.values])
df.drop(['Employees'], axis=1, inplace=True)
final_df = pd.concat([df, df_emp], axis=1)
final_df.head()

   Data_Id   Id          Name  Salary
0     1210  121  Sangita Shah   50000
1     1211  122    Suraj Kale   25000
2     1212  123   Ranjan Suri   10000
3     1213  124  Manju Shakya  100000